Repository: qiaob/baobox_mac
Catalog: Sources/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# claudecode.notify.budget.title
source: Usage budget alert
zh_hans: 额度提醒

# claudecode.notify.budget.body %lld
source: You've used %lld%% of this window's budget
zh_hans: 本额度窗口已用 %lld%% 预算

# claudecode.notify.budgetRestored.title
source: Budget window reset
zh_hans: 额度已恢复

# claudecode.notify.budgetRestored.body
source: A new 5-hour usage window has started
zh_hans: 新的 5 小时额度窗口已开始

# claudecode.notify.weeklyBudget.title
source: Weekly budget alert
zh_hans: 周额度提醒

# claudecode.notify.weeklyBudget.body %lld
source: You've used %lld%% of this week's budget
zh_hans: 本周额度已用 %lld%% 预算

# claudecode.notify.weeklyBudgetRestored.title
source: Weekly budget reset
zh_hans: 本周额度已恢复

# claudecode.notify.weeklyBudgetRestored.body
source: A new weekly usage window has started
zh_hans: 新的一周额度窗口已开始

# claudecode.guard.preset.rmRfRoot
source: Recursively delete root (rm -rf /)
zh_hans: 递归删除根目录（rm -rf /）

# claudecode.guard.preset.rmRfHome
source: Recursively delete home (rm -rf ~)
zh_hans: 递归删除主目录（rm -rf ~）

# claudecode.guard.preset.sudoRm
source: Delete as root (sudo rm)
zh_hans: 以管理员删除（sudo rm）

# claudecode.guard.preset.gitPushForce
source: Force push (git push --force)
zh_hans: 强制推送（git push --force）

# claudecode.guard.preset.gitResetHard
source: Hard reset (git reset --hard)
zh_hans: 硬重置（git reset --hard）

# claudecode.guard.preset.gitCleanForce
source: Force clean (git clean -fd)
zh_hans: 强制清理（git clean -fd）

# claudecode.guard.preset.dropTable
source: Drop database table (DROP TABLE)
zh_hans: 删除数据表（DROP TABLE）

# claudecode.guard.preset.mkfs
source: Format filesystem (mkfs)
zh_hans: 格式化文件系统（mkfs）

# claudecode.guard.preset.chmod777
source: Recursively grant all permissions (chmod -R 777)
zh_hans: 递归开放全部权限（chmod -R 777）
